## Clean Schools.csv
1. Split address column
2. Look at length - this displays discrepancies in addresses (looking for lengths 1, 3, 4)
3. Create a city and state column - consistency with other data
4. Create columns for schools categories - pk, k, elementary, middle, and high school
5. Make score column an int

In [1]:
import pandas as pd
pd.set_option('display.max_colwidth', None)
pd.set_option('display.max_rows', 10)

/Users/jisha/.pyenv/versions/3.8.6/lib/python3.8/site-packages/pandas/compat/__init__.py:120: UserWarning: Could not import the lzma module. Your installed Python is incomplete. Attempting to use lzma compression will result in a RuntimeError.
  warnings.warn(msg)

In [2]:
df = pd.read_csv('files/scrape_schools/schools.csv')

In [3]:
print(df.shape)
df.head()

(58782, 10)

,Unnamed: 0,School,Score,Rating,Address,Type,Grades,Total Students Enrolled,Students per teacher,District
0,0,Akron Early College High School,10/10,Top rated,"225 South Main Street, Akron, OH, 44308",Public district,9-12,384.0,34:1,Akron City School District
1,1,Revere Middle School,9/10,Above average,"3195 Spring Valley Road, Akron, OH, 44333",Public district,6-8,624.0,13:1,Revere Local School District
2,2,Arrowhead Primary Elementary School,8/10,Above average,"1600 Raleigh Boulevard, Akron, OH, 44321",Public district,K-4,345.0,20:1,Copley-Fairlawn City School District
3,3,Manchester Middle School,8/10,Above average,"760 West Nimisila Road, Akron, OH, 44319",Public district,5-8,387.0,16:1,Manchester Local School District
4,4,Nolley Elementary School,8/10,Above average,"6285 Renninger Rd, Akron, OH, 44319",Public district,K-4,483.0,17:1,Manchester Local School District

### Clean Addresses

In [4]:
df['Address'] = df['Address'].str.replace('2100 Morse Road, Suite 4609, Columbus, OH 43229, Columbus, OH, 43211', '2100 Morse Road, Suite 4609, Columbus, OH, 43229')
df['Address'] = df['Address'].str.replace('2501 Syracuse Street, Denver, Colorado, 80238, Denver, CO, 80238', '2501 Syracuse Street, Denver, CO, 80238')
df['Address'] = df['Address'].str.replace('4450 West Eau Gallie Boulevard, Suite 180, Melbourne, FL 32934, Melbourne, FL, 32934', '4450 West Eau Gallie Boulevard, Suite 180, Melbourne, FL, 32934')
df['Address'] = df['Address'].str.replace('4530 MacArthur Blvd, NW, Washington, DC, Washington, DC, 20007', '4530 MacArthur Blvd NW, Washington, DC, 20007')
df['Address'] = df['Address'].str.replace('1075 New Scotland Road, Albany NY 12208, Albany, NY, 12208', '1075 New Scotland Road, Albany NY, 12208')
df['Address'] = df['Address'].str.replace('216 Shelburne Road Asheville, NC 28806, Asheville, NC, 28806', '216 Shelburne Road, Asheville, NC, 28806')
df['Address'] = df['Address'].str.replace('26450 RR 12 Dripping Springs, TX 78620, Austin, TX, 78736', '26450 RR 12, Dripping Springs, TX, 78620')
df['Address'] = df['Address'].str.replace('NE Stoneridge Loop, Prineville OR 97754, Bend, OR, 97702', 'NE Stoneridge Loop, Prineville, OR, 97754')
df['Address'] = df['Address'].str.replace('5225 - Seventy seven Center Dr, Charlotte NC 28217, Charlotte, NC, 28217', '5225 77 Center Dr, Charlotte, NC, 28217')
df['Address'] = df['Address'].str.replace('3375 W. 99th Street Cleveland, OH 44102, Cleveland, OH, 44111', '3375 W. 99th Street, Cleveland, OH, 44102')
df['Address'] = df['Address'].str.replace('21 Broadmoor Avenue Colorado Springs, CO 80906, Colorado Springs, CO, 80906', '21 Broadmoor Avenue, Colorado Springs, CO, 80906')
df['Address'] = df['Address'].str.replace('220 Stoneridge Drive Suite 403 Columbia, SC 29210 , Columbia, SC, 29210', '220 Stoneridge Drive, Suite 403, Columbia, SC, 29210')
df['Address'] = df['Address'].str.replace('2247 South Ridgewood South Daytona, Florida 32119, Daytona Beach, FL, 32117', '2247 South Ridgewood, South Daytona, FL, 32119')
df['Address'] = df['Address'].str.replace('7005 Woodbine Ave Sacramento, Ca. 95822, Fairfield, CA, 94534', '7005 Woodbine Ave, Sacramento, CA, 95822')
df['Address'] = df['Address'].str.replace('4424 Innovation Drive Fort Collins, Colorado 80525, Fort Collins, CO, 80525', '4424 Innovation Drive, Fort Collins, CO, 80525')
df['Address'] = df['Address'].str.replace('5300 El Camino Road Las Vegas, NV 89118, Henderson, NV, 89014', '5300 El Camino Road, Las Vegas, NV, 89118')
df['Address'] = df['Address'].str.replace('9039 Beach Blvd Jacksonville, FL 32216, Jacksonville, FL, 32207', '9039 Beach Blvd, Jacksonville, FL, 32216')
df['Address'] = df['Address'].str.replace('390 New Holland Pike, Lancaster PA 17601, Lancaster, PA, 17601', '390 New Holland Pike, Lancaster, PA, 17601')
df['Address'] = df['Address'].str.replace('4801. S. Sandhill Drive LV, NV 89121, Las Vegas, NV, 89123', '4801. S. Sandhill Drive, Las Vegas, NV, 89123')
df['Address'] = df['Address'].str.replace('2727 Stinson Blvd. NE Minneapolis, MN 55418, Minneapolis, MN, 55418', '2727 Stinson Blvd. NE, Minneapolis, MN, 55418')
df['Address'] = df['Address'].str.replace('3000 53rd St SW Naples, FL 34116, Naples, FL, 34116', '3000 53rd St SW, Naples, FL, 34116')
df['Address'] = df['Address'].str.replace('177 W Klein Rd. New Braunfels, TX 78130, New Braunfels, TX, 78130', '177 W Klein Rd., New Braunfels, TX, 78130')
df['Address'] = df['Address'].str.replace('500 Soraparu St. New Orleans, La 70130, New Orleans, LA, 70130', '500 Soraparu St., New Orleans, LA, 70130')
df['Address'] = df['Address'].str.replace('2162 Mountain Blvd, Oakland CA 94611, Oakland, CA, 94605', '2162 Mountain Blvd, Oakland, CA, 94611')
df['Address'] = df['Address'].str.replace('13231 N. 22nd St. Phoenix, AZ 85022, Phoenix, AZ, 85028', '13231 N. 22nd St., Phoenix, AZ, 85022')
df['Address'] = df['Address'].str.replace('14124 SE Mill St, Portland OR 97233, Portland, OR, 97266', '14124 SE Mill St, Portland, OR, 97233')
df['Address'] = df['Address'].str.replace('555 Double Eagle Ct. Suite 2000 Reno, NV 89521 , Reno, NV, 89521', '555 Double Eagle Ct., Suite 2000, Reno, NV, 89521')
df['Address'] = df['Address'].str.replace('3422 Rustin Ave Riverside, CA 92507, Riverside, CA, 92504', '3422 Rustin Ave, Riverside, CA, 92507')
df['Address'] = df['Address'].str.replace('2800 19th Stree NW Rochester, MN 55901, Rochester, MN, 55902', '2800 19th Stree NW, Rochester, MN, 55901')
df['Address'] = df['Address'].str.replace('9510 Carmel Mountain Road, San Diego CA 92129, San Diego, CA, 92129', '9510 Carmel Mountain Road, San Diego CA, 92129')
df['Address'] = df['Address'].str.replace('6540 Flanders Drive. San Diego, CA 92121, San Diego, CA, 92127', '6540 Flanders Drive., San Diego, CA, 92121')
df['Address'] = df['Address'].str.replace('725 Washington St. Santa Clara, Ca 95050, Santa Clara, CA, 95050', '725 Washington St., Santa Clara, CA, 95050')
df['Address'] = df['Address'].str.replace('6715 S Boe Lane Sioux Falls, SD 57108, Sioux Falls, SD, 57105', '6715 S Boe Lane, Sioux Falls, SD, 57108')
df['Address'] = df['Address'].str.replace('12611 N. Wilson St. Mead, WA 99021, Spokane, WA, 99218', '12611 N. Wilson St., Mead, WA, 99021')
df['Address'] = df['Address'].str.replace('1450 Newfield Avenue Stamford, CT 06905, Stamford, CT, 06905', '1450 Newfield Avenue, Stamford, CT, 06905')
df['Address'] = df['Address'].str.replace('2525 Gold Brook Dr Stockton, CA 95212, Stockton, CA, 95212', '2525 Gold Brook Dr, Stockton, CA, 95212')
df['Address'] = df['Address'].str.replace('1112 North G Street | Tacoma, WA 98403, Tacoma, WA, 98403', '1112 North G Street, Tacoma, WA, 98403')
df['Address'] = df['Address'].str.replace('1250 Erbes Rd. Thousand Oaks, CA 91362, Thousand Oaks, CA, 91302', '1250 Erbes Rd., Thousand Oaks, CA, 91362')
df['Address'] = df['Address'].str.replace('3201 N. Eastman Rd. Longview, TX 75605, Tyler, TX, 75799', '3201 N. Eastman Rd., Longview, TX, 75605')
df['Address'] = df['Address'].str.replace('St. Catherine of Siena School, 3460 Tennessee Street, Vallejo, CA, 94591', '3460 Tennessee Street, Vallejo, CA, 94591')
df['Address'] = df['Address'].str.replace('1650 Godfrey Ave. Wyoming,Mi 49509 , Wyoming, MI, 49509', '1650 Godfrey Ave., Wyoming, MI, 49509' )
df['Address'] = df['Address'].str.replace('3422 Rustin Ave Riverside, CA 92507', '3422 Rustin Ave, Riverside, CA, 92507')
df['Address'] = df['Address'].str.replace('San Martin De Porres Clinic: Kallumadanda Vinnie MD Mission, TX 78572', 'San Martin De Porres Clinic: Kallumadanda Vinnie MD, Mission, TX, 78572') # 33396
df['Address'] = df['Address'].str.replace('Rockwood Plastic Surgery Center: Gardner Glenn P MD Spokane, WA 99204', 'Rockwood Plastic Surgery Center: Gardner Glenn P MD, Spokane, WA, 99204' ) # 50841
df['Address'] = df['Address'].str.replace('2950 East 29th Street, Long Beach, CA', '2950 E 29th St, Long Beach, CA, 90806')	
df['Address'] = df['Address'].str.replace('2585 Business Park Drive, Vista, 92081', '2585 Business Park Dr, Vista, CA, 92081')
df['Address'] = df['Address'].str.replace('401 E Arrowood Rd, Charlotte, Nc', '401 E Arrowood Rd, Charlotte, NC, 28217')
df['Address'] = df['Address'].str.replace('2900 Barberry Avenue, Columbia, Missouri 65202', '2900 Barberry Avenue, Columbia, MO, 65202')
df['Address'] = df['Address'].str.replace('2572 John F Kennedy Boulevard, Jersey City, New Jersey 07304', '2572 John F Kennedy Boulevard, Jersey City, NJ, 07304')
df['Address'] = df['Address'].str.replace('4656 N. Rancho Drive, Las Vegas, Nevada 89130', '4656 N. Rancho Drive, Las Vegas, NV, 89130')
df['Address'] = df['Address'].str.replace('6415 SE Morrison street, Portland, Oregon 97215', '6415 SE Morrison Street, Portland, OR, 97215')
df['Address'] = df['Address'].str.replace('2120 21st Avenue South, Seattle, Washington 98144', '2120 21st Avenue South, Seattle, WA, 98144')
df['Address'] = df['Address'].str.replace('4025 N. Hartford Ave., Tulsa, OK. 74106', '4025 N. Hartford Ave., Tulsa, OK, 74106')
df['Address'] = df['Address'].str.replace('6355 Willowbrook St., Wichita, Ks 67208', '6355 Willowbrook St., Wichita, KS, 67208')
df['Address'] = df['Address'].str.replace('4314 clarno dr, austin, TX 78749', '4314 Clarno Dr, Austin, TX 78749')
df['Address'] = df['Address'].str.replace('Suite 117', 'Suite 117,')

In [5]:
# specific 
df.at[52126, 'Address'] = '1112 North G Street, Tacoma, WA, 98403'
df.at[46311, 'Address'] = '5531 Cancha de Golf Ste 202, Rancho Santa Fe, CA, 92091'
df.at[56607, 'Address'] = '4880 MacArthur Blvd. NW, Washington, DC, 20007'
df.at[27205, 'Address'] = '1018 Harding Street, Suite 112, Lafayette, LA, 70503'
df.at[50525, 'Address'] = '8740 Asheville Hwy, Spartanburg, SC, 29316'
df.at[397, 'Address'] = '1075 New Scotland Road, Albany, NY, 12208'
df.at[8207, 'Address'] = '3500 Cleveland Avenue NW, Canton, OH, 44709'
df.at[8292, 'Address'] = '231 Del Prado Blvd. S, Cape Coral, FL, 33990'
df.at[11542, 'Address'] = '1320 South Fairview Road, Columbia MO, 65203'
df.at[18372, 'Address'] = '7005 Woodbine Ave, Sacramento, CA, 95822'
df.at[19249, 'Address'] = '4424 Innovation Drive, Fort Collins, CO, 80525'
df.at[21626, 'Address'] = '1130 Eliza St.,, Green Bay, WI, 54301'
df.at[38985, 'Address'] = '2211 Saint Andrews Blvd., Panama City FL, 32405'
df.at[42682, 'Address'] = '5510 Munford Road, Raleigh NC, 27612'
df.at[46031, 'Address'] = '2850 Logan Ave, San Diego, CA, 92113'
df.at[46285, 'Address'] = '9510 Carmel Mountain Road, San Diego, CA, 92129'
df.at[54169, 'Address']  = '3535 West Messala Way, Tucson, AZ, 85746'
df.at[56231, 'Address'] = '2200 Minnesota Av. SE Washington DC, 20020'
df.at[56603, 'Address'] = '3328 Martin Luther King Junior Avenue Southeast,  Washington DC, 20032'
df.at[10584, 'Address'] = '3375 W. 99th Street, Cleveland, OH, 44102'
df.at[11668, 'Address'] = '220 Stoneridge Drive, Suite 403, Columbia, SC, 29210'
df.at[23334, 'Address'] = '5300 El Camino Road, Las Vegas, NV, 89118'
df.at[34536, 'Address'] = '3000 53rd St SW, Naples, FL, 34116'
df.at[36778, 'Address'] = '2162 Mountain Blvd, Oakland, CA, 94611'
df.at[41320, 'Address'] = '6415 SE Morrison Street, Portland, OR, 97215'
df.at[42400, 'Address'] = '555 Double Eagle Ct., Suite 2000, Reno, NV, 89521'
df.at[49117, 'Address'] = '12351 8th Ave NE, Seattle, WA, 98125'
df.at[49183	, 'Address'] = '2120 21st Avenue South, Seattle, WA, 98144'
df.at[56231, 'Address'] = '2200 Minnesota Av. SE, Washington, DC, 20020'
df.at[11542, 'Address'] = '1320 South Fairview Road, Columbia, MO, 65203'
df.at[38985, 'Address'] = '2211 Saint Andrews Blvd., Panama City, FL, 32405'
df.at[42682, 'Address'] = '5510 Munford Road, Raleigh, NC, 27612'
df.at[56603, 'Address'] = '3328 Martin Luther King Junior Avenue Southeast, Washington, DC, 20032'

In [6]:
df['Address'] = df['Address'].str.replace('Washington, DC, Washington, DC,', 'Washington, DC,')
df['Address'] = df['Address'].str.replace('New Orleans, LA, New Orleans, LA,', 'New Orleans, LA,')
df['Address'] = df['Address'].str.replace('Albuquerque, NM, Albuquerque, NM,', 'Albuquerque, NM,' )
df['Address'] = df['Address'].str.replace('Chelsea, MA, Boston, MA,', 'Chelsea, MA,' )
df['Address'] = df['Address'].str.replace('Franklin, TN, Franklin, TN,', 'Franklin, TN,')
df['Address'] = df['Address'].str.replace('Hales Corners, WI, Milwaukee, WI', 'Hales Corners, WI,') # 50525
df['Address'] = df['Address'].str.replace('Albany NY', 'Albany, NY,' )
df['Address'] = df['Address'].str.replace('Prineville OR', 'Prineville, OR,')
df['Address'] = df['Address'].str.replace('Lancaster PA', 'Lancaster, PA,')
df['Address'] = df['Address'].str.replace('Portland OR', 'Portland, OR,')
df['Address'] = df['Address'].str.replace('San Diego CA', 'San Diego, CA,')
df['Address'] = df['Address'].str.replace('austin', 'Austin')
df['Address'] = df['Address'].str.replace('milwaukee', 'Milwaukee')
df['Address'] = df['Address'].str.replace('greeley', 'Greeley')
df['Address'] = df['Address'].str.replace('Oklahoma city', 'Oklahoma City')
df['Address'] = df['Address'].str.replace('CARMEL', 'Carmel')
df['Address'] = df['Address'].str.replace('COLORADO SPRINGS', 'Colorado Springs')
df['Address'] = df['Address'].str.replace('GREENSBORO', 'Greensboro')
df['Address'] = df['Address'].str.replace('SAN DIEGO', 'San Diego')
df['Address'] = df['Address'].str.replace('Cherry Hill/Baltimore', 'Cherry Hill')

In [7]:
df['Address'] = df['Address'].str.replace('AL ', 'AL, ')
df['Address'] = df['Address'].str.replace('AK ', 'AK, ')
df['Address'] = df['Address'].str.replace('AR ', 'AR, ')
df['Address'] = df['Address'].str.replace('AZ ', 'AZ, ')
df['Address'] = df['Address'].str.replace('CA ', 'CA, ')
df['Address'] = df['Address'].str.replace('CO ', 'CO, ')
df['Address'] = df['Address'].str.replace('CT ', 'CT, ')
df['Address'] = df['Address'].str.replace('DE ', 'DE, ')
df['Address'] = df['Address'].str.replace('DC ', 'DC, ')
df['Address'] = df['Address'].str.replace('FL ', 'FL, ')
df['Address'] = df['Address'].str.replace('GA ', 'GA, ')
df['Address'] = df['Address'].str.replace('HI ', 'HI, ')
df['Address'] = df['Address'].str.replace('IA ', 'IA, ')
df['Address'] = df['Address'].str.replace('ID ', 'ID, ')
df['Address'] = df['Address'].str.replace('IL ', 'IL, ')
df['Address'] = df['Address'].str.replace('IN ', 'IN, ')
df['Address'] = df['Address'].str.replace('KS ', 'KS, ')
df['Address'] = df['Address'].str.replace('KY ', 'KY, ')
df['Address'] = df['Address'].str.replace('LA ', 'LA, ')
df['Address'] = df['Address'].str.replace('MA ', 'MA, ')
df['Address'] = df['Address'].str.replace('MD ', 'MD, ')
df['Address'] = df['Address'].str.replace('ME ', 'ME, ')
df['Address'] = df['Address'].str.replace('MI ', 'MI, ')
df['Address'] = df['Address'].str.replace('MN ', 'MN, ')
df['Address'] = df['Address'].str.replace('MO ', 'MO, ')
df['Address'] = df['Address'].str.replace('MS ', 'MS, ')
df['Address'] = df['Address'].str.replace('MT ', 'MT, ')
df['Address'] = df['Address'].str.replace('NC ', 'NC, ')
df['Address'] = df['Address'].str.replace('ND ', 'ND, ')
df['Address'] = df['Address'].str.replace('NH ', 'NH, ')
df['Address'] = df['Address'].str.replace('NJ ', 'NJ, ')
df['Address'] = df['Address'].str.replace('NM ', 'NM, ')
df['Address'] = df['Address'].str.replace('NV ', 'NV, ')
df['Address'] = df['Address'].str.replace('NY ', 'NY, ')
df['Address'] = df['Address'].str.replace('OH ', 'OH, ')
df['Address'] = df['Address'].str.replace('OK ', 'OK, ')
df['Address'] = df['Address'].str.replace('OR ', 'OR, ')
df['Address'] = df['Address'].str.replace('PA ', 'PA, ')
df['Address'] = df['Address'].str.replace('RI ', 'RI, ')
df['Address'] = df['Address'].str.replace('SC ', 'SC, ')
df['Address'] = df['Address'].str.replace('SD ', 'SD, ')
df['Address'] = df['Address'].str.replace('TN ', 'TN, ')
df['Address'] = df['Address'].str.replace('TX ', 'TX, ')
df['Address'] = df['Address'].str.replace('UT ', 'UT, ')
df['Address'] = df['Address'].str.replace('VA ', 'VA, ')
df['Address'] = df['Address'].str.replace('VT ', 'VT, ')
df['Address'] = df['Address'].str.replace('WA ', 'WA, ')
df['Address'] = df['Address'].str.replace('WI ', 'WI, ')
df['Address'] = df['Address'].str.replace('WV ', 'WV, ')
df['Address'] = df['Address'].str.replace('WY ', 'WY, ')

### Split Address Column
- look for more discrepancies

### Create lengths to find discrepancies in 'Address' column

In [8]:
df['City, State']  = df['Address'].str.split(',')

In [9]:
# Finding length because there are anomalies with the information in the address column
df['Length'] = df['City, State'].apply(lambda x: len(x) if x != None else 0 )
# 4 is the expected length 
df['Length'].unique()

array([4, 7, 5, 1, 8])

### Create new dataframes for different lengths

### Length 1

In [10]:
# No Address - removing from df
df = df[df['Length'] != 1]

### Length 7
- https://stackoverflow.com/questions/6266727/python-cut-off-the-last-word-of-a-sentence
- https://towardsdatascience.com/a-really-simple-way-to-edit-row-by-row-in-a-pandas-dataframe-75d339cbd313

In [11]:
df.loc[df['Length'] == 7]

,Unnamed: 0,School,Score,Rating,Address,Type,Grades,Total Students Enrolled,Students per teacher,District,"City, State",Length
553,553,Mountain Mahogany Community School,6/10,Average,"5014 4th Street NW, Albuquerque, NM, 87107, Albuquerque, NM, 87107",Public charter,K-8,187.0,17:1,Albuquerque Public Schools,"[5014 4th Street NW, Albuquerque, NM, 87107, Albuquerque, NM, 87107]",7
1006,1006,Acton Academy Albuquerque,0/10,Currently unrated,"3100 Menaul Blvd NE, Albuquerque, NM, 87107, Albuquerque, NM, 87109",Private,1-6,NaN,NaN,NaN,"[3100 Menaul Blvd NE, Albuquerque, NM, 87107, Albuquerque, NM, 87109]",7
2096,2096,Anderson Christian School,0/10,Currently unrated,"5401 S. Madison Ave, Anderson, IN, 46013, Anderson, IN, 46012",Private,"PK-9, 11-12",56.0,NaN,NaN,"[5401 S. Madison Ave, Anderson, IN, 46013, Anderson, IN, 46012]",7
2148,2148,Go Like The Wind Montessori School,0/10,Currently unrated,"8845 Main St., Whitmore Lake, MI, 48189, Ann Arbor, MI, 48105",Private,PK-9,131.0,NaN,NaN,"[8845 Main St., Whitmore Lake, MI, 48189, Ann Arbor, MI, 48105]",7
2382,2382,Newman International Academy Of Ar,6/10,Average,"2011 S Fielder Rd, Arlington, TX, 76013 , Arlington, TX, 76003",Public charter,PK-12,870.0,13:1,Newman International Academy Of Arlington,"[2011 S Fielder Rd, Arlington, TX, 76013 , Arlington, TX, 76003]",7
...,...,...,...,...,...,...,...,...,...,...,...,...
55833,55833,Central Faith Child Development Center,0/10,Currently unrated,"5720 Bagby Avenue, Waco, TX, 76712, Waco, TX, 76712",Private,PK,NaN,NaN,NaN,"[5720 Bagby Avenue, Waco, TX, 76712, Waco, TX, 76712]",7
55976,55976,May V. Peck Elementary School,7/10,Above average,"26201 Lorraine, Center Line, MI, 48015, Warren, MI, 48089",Public district,K-5,325.0,15:1,Center Line Public Schools,"[26201 Lorraine, Center Line, MI, 48015, Warren, MI, 48089]",7
56786,56786,Georgetown Day School - Upper School,0/10,Currently unrated,"4200 Davenport Street NW, Washington, DC, 20009, Washington, DC, 20016",Private,9-12,NaN,NaN,NaN,"[4200 Davenport Street NW, Washington, DC, 20009, Washington, DC, 20016]",7
57658,57658,Classical School of Wichita,0/10,Currently unrated,"6355 Willowbrook St., Wichita, KS, 67208, Wichita, KS, 67218",Private,K-12 & Ungraded,NaN,NaN,NaN,"[6355 Willowbrook St., Wichita, KS, 67208, Wichita, KS, 67218]",7
58140,58140,Wilmington Academy Of Arts & Sci,0/10,Currently unrated,"6201 Myrtle Grove Road, Wilmington, NC, 28412, Wilmington, NC, 28409",Private,4-8,70.0,NaN,NaN,"[6201 Myrtle Grove Road, Wilmington, NC, 28412, Wilmington, NC, 28409]",7

In [12]:
for index in df.index:
    if df.loc[index, 'Length'] == 7:
        content = df.loc[index, 'Address']
        df.loc[index, 'Address'] = ', '.join(content.split(', ')[:-3])

### Length 8

In [13]:
df.loc[df['Length'] == 8]

,Unnamed: 0,School,Score,Rating,Address,Type,Grades,Total Students Enrolled,Students per teacher,District,"City, State",Length
40342,40342,Kaleidoscope Preschool,0/10,Currently unrated,"3434 W. Greenway Rd., Suite 117, Phoenix, AZ, 85053, Phoenix, AZ, 85023",Private,PK,NaN,NaN,NaN,"[3434 W. Greenway Rd., Suite 117, Phoenix, AZ, 85053, Phoenix, AZ, 85023]",8

In [14]:
for index in df.index:
    if df.loc[index, 'Length'] == 8:
        content = df.loc[index, 'Address']
        df.loc[index, 'Address'] = ', '.join(content.split(', ')[:-3])

### Check

In [15]:
df = df.drop(columns = ['City, State', 'Length'])

In [16]:
df['City, State']  = df['Address'].str.split(',')

In [17]:
# Checking string lengths after cleaning
df['Length'] = df['City, State'].apply(lambda x: len(x) if x != None else 0 )
df['Length'].unique()

array([4, 5])

### Create City, State columns

In [18]:
df['City'] = df['City, State'].str[-3]

In [19]:
df['State'] = df['City, State'].str[-2]

### Check Unique Cities

In [20]:
print(df['City'].nunique())
df['City'].unique()

396

array([' Akron', ' Albany', ' Albuquerque', ' Alexandria', ' Allentown',
       ' Altoona', ' Amarillo', ' Anacortes', ' Anaheim', ' Anchorage',
       ' Anderson', ' Ann Arbor', ' Whitmore Lake', ' Appleton',
       ' Arlington', ' Arroyo Grande', ' Asheville', ' Ashland',
       ' Athens', ' Atlantic City', ' Auburn', ' Aurora', ' Austin',
       ' Dripping Springs', ' Bakersfield', ' Baltimore', ' Cherry Hill',
       ' Bangor', ' Baton Rouge', ' Bay City', ' Beaumont', ' Bellevue',
       ' Bellingham', ' Beloit', ' Bend', ' Prineville', ' Benton Harbor',
       ' Billings', ' Biloxi', ' Bismarck', ' Blacksburg', ' Bloomington',
       ' Bossier City', ' Boston', ' Chelsea', ' Hyde Park', ' Boulder',
       ' Bowling Green', ' Bradenton', ' Bremerton', ' Bridgeport',
       ' Bridgeton', ' Bristol', ' Brookings', ' Brownsville', ' Bryan',
       ' Buffalo', ' Burlington', ' Cambridge', ' Canton', ' Cape Coral',
       ' Carlsbad', ' Vista', ' Carmel', ' Casper', ' Cedar Rapids',
       ' Chambersburg', ' Champaign', ' Chapel Hill', ' Charleston',
       ' Charlotte', ' Charlottesville', ' Cheyenne', ' Chicago',
       ' Chico', ' Christiansburg', ' Clearfield', ' Clearwater',
       ' Cleveland', ' Clinton', ' College Station', ' Colorado Springs',
       ' Columbia', ' Columbus', ' Concord', ' Conway', ' Corcoran',
       ' Corpus Christi', ' Council Bluffs', ' Crestview', ' Cumberland',
       ' Dallas', ' Dayton', ' Daytona Beach', ' South Daytona',
       ' Decatur', ' Denver', ' Des Moines', ' Detroit', ' Douglas',
       ' Dover', ' Duluth', ' Durham', ' East Lansing', ' Eau Claire',
       ' Edinburg', ' Effingham', ' El Centro', ' El Paso',
       ' Elizabethtown', ' Elko', ' Elyria', ' Enid', ' Erie', ' Eugene',
       ' Evansville', ' Fairbanks', ' Fairfield', ' Sacramento',
       ' Fayetteville', ' Flagstaff', ' Flint', ' Florence',
       ' Fort Collins', ' Fort Lauderdale', ' Fort Myers', ' Fort Smith',
       ' Fort Walton Beach', ' Fort Wayne', ' Fort Worth', '  Fort Worth',
       ' Franklin', ' Gainesville', ' Grand Junction', ' Grand Rapids',
       ' Grants Pass', ' Great Falls', ' Greeley', ' Green Bay',
       ' Greensboro', ' Greenville', ' Gulfport', ' Hagerstown',
       ' Hammonton', ' Hanford', ' Hanover', ' Harlingen', ' Harrisburg',
       ' Harrisonburg', ' Hartford', ' Hattiesburg', ' Henderson',
       ' Las Vegas', ' Hickory', ' High Point', ' Hillsboro', ' Holland',
       ' Honolulu', ' Houghton', ' Houma', ' Houston', ' Idaho Falls',
       ' Ammon', ' Indiana', ' Iowa City', ' Ithaca', ' Jackson',
       ' Jacksonville', ' Janesville', ' Jasper', ' Jefferson City',
       ' Jersey City', ' Joplin', ' Juneau', ' Kalamazoo', ' Kennewick',
       ' Killeen', ' Kingman', ' Kingsport', ' Kissimmee', ' Knoxville',
       ' Kokomo', ' La Porte', ' Lafayette', ' Lake Charles',
       ' Lake Havasu City', ' Lakeland', ' Lancaster', ' Lansing',
       ' Laredo', ' Las Cruces', ' Lawton', ' Lebanon', ' Lenoir',
       ' Lewiston', ' Lexington', ' Lima', ' Lincoln', ' Little Rock',
       ' Lodi', ' Long Beach', ' Longview', ' Los Alamos', ' Los Angeles',
       ' Lubbock', ' Lynchburg', ' Madera', ' Madison', ' Manchester',
       ' Manitowoc', ' Marco Island', ' Marshall', ' Massillon',
       ' Mauldin', ' Melbourne', ' Merced', ' Mesa', ' Miami', ' Milford',
       ' Milwaukee', ' WI', ' Minneapolis', ' Mission', ' Missoula',
       ' Modesto', ' Moline', ' Monroe', ' Morganton', ' Morgantown',
       ' Morristown', ' Mount Vernon', ' Murfreesboro', ' Muscatine',
       ' Muskegon', ' Muskogee', ' Myrtle Beach', ' Napa', ' Naples',
       ' Nashua', ' Nashville', ' New Braunfels', ' New Haven',
       ' New London', ' New Orleans', ' New York', ' Newark',
       ' Niagara Falls', ' Niles', ' North Charleston',
       ' North Little Rock', ' North Myrtle Beach', ' North Port',
       ' Norwalk', ' Norwich', ' Oakland', ' Ocala', ' Odessa', ' Ogden',
       ' Oklahoma City', ' Olympia', ' Ontario', ' Orem', ' Orlando',
       ' Ormond Beach', ' Owensboro', ' Oxnard', ' Palm Bay',
       ' Panama City', ' Pascagoula', ' Pensacola', ' Peoria', ' Phoenix',
       ' Pittsfield', ' Pocatello', ' Chubbuck', ' Port Arthur',
       ' Portage', ' Porterville', ' Portland', ' Prescott', ' Provo',
       ' Saratoga Springs', ' Pueblo', ' Racine', ' Radford', ' Raleigh',
       ' Rapid City', ' Redmond', ' Reno', ' Richland', ' Richmond',
       ' Henrico', ' Riverside', ' Roanoke', ' Rochester', ' Rock Island',
       ' Rockford', ' Rocky Mount', ' Rogers', ' Rome', ' Roseville',
       ' Round Rock', ' Rutland', ' Salem', ' Salinas', ' Salisbury',
       ' Salt Lake City', ' San Antonio', ' San Bernardino', ' San Diego',
       ' Rancho Santa Fe', ' La Jolla', ' San Francisco', ' San Jose',
       ' San Luis Obispo', ' Sanford', ' Santa Barbara', ' Santa Clara',
       ' Santa Cruz', ' Santa Rosa', ' Sarasota', ' Schenectady',
       ' Scottsbluff', ' Scottsdale', ' Paradise Valley', ' Scranton',
       ' Seattle', ' Shoreline', ' Sebastian', ' Sebring', ' Sheboygan',
       ' Sheridan', ' Shreveport', ' Sierra Vista', ' Sioux City',
       ' Sioux Falls', ' South Bend', ' South Burlington', ' Spartanburg',
       ' Spokane', ' Mead', ' Springfield', ' Stamford', ' State College',
       ' Steubenville', ' Stockton', ' Sunnyvale', ' Syracuse', ' Tacoma',
       ' Tallahassee', ' Tampa', ' Taos', ' Temple', ' Texarkana',
       ' Thibodaux', ' Thousand Oaks', ' Titusville', ' Toledo',
       ' Topeka', ' Trenton', ' Troy', ' Tucson', ' Tulsa', ' Twin Falls',
       ' Tyler', ' Urbana', ' Utica', ' Vallejo', ' Vero Beach',
       ' Victoria', ' Vineland', ' Visalia', ' Waco', ' Walla Walla',
       ' Warner Robins', ' Center Line', ' Warren', ' Washington',
       ' Waterloo', ' Watertown', ' Watsonville', ' Waukesha', ' Wausau',
       ' Wenatchee', ' West Lafayette', ' West Palm Beach', ' Wichita',
       ' Wilmington', ' Winchester', ' Winona', ' Winter Haven',
       ' Worcester', ' Wyoming', ' Yakima', ' Yuba City', ' Yuma'],
      dtype=object)

### Check Unique States

In [21]:
print(df['State'].nunique())
df['State'].unique()

50

array([' OH', ' GA', ' NY', ' OR', ' NM', ' LA', ' PA', ' TX', ' WA',
       ' CA', ' AK', ' IN', ' MI', ' WI', ' NC', ' KY', ' NJ', ' ME',
       ' CO', ' MD', ' MT', ' MS', ' ND', ' VA', ' IL', ' MA', ' FL',
       ' CT', ' TN', ' SD', ' VT', ' WY', ' IA', ' SC', ' UT', ' MO',
       ' AR', ' AZ', ' DE', ' MN', ' NV', ' OK', ' HI', ' ID', ' NE',
       ' NH', '', ' WV', ' KS', ' DC'], dtype=object)

In [22]:
df.loc[df['State'] == '']

,Unnamed: 0,School,Score,Rating,Address,Type,Grades,Total Students Enrolled,Students per teacher,District,"City, State",Length,City,State
32718,32718,Lutheran Special School & Education Services,0/10,Currently unrated,"5425 S. 111th Street, Hales Corners, WI,, 53222",Private,1-8,74.0,NaN,NaN,"[5425 S. 111th Street, Hales Corners, WI, , 53222]",5,WI,

In [23]:
df.at[32718, 'Address'] = '5425 S. 111th Street, Hales Corners, WI, 53222'
df.at[32718, 'State'] = 'WI'
df.at[32718, 'City'] = 'Hales Corners'

### Update School Score
- change to int so data can be sorted by the value

In [24]:
df['Score'] = df['Score'].str.replace('/10', '')
df['Score'] = df['Score'].astype(int)

### Separating into PK, K, Elementary, Middle, High School
- https://stackoverflow.com/questions/61877712/check-if-an-item-in-a-list-is-available-in-a-column-which-is-of-type-list

In [25]:
def parse_grades(grades_string):
    GRADES = ['PK', 'K', '1', '2', '3', '4', '5', '6', '7', '8', '9', '10', '11', '12', 'Ungraded']

    # Remove & for grades list
    grades_string = grades_string.replace(' &', ',')

    # Grades list - will add to separated grade string to grades
    grades = []

    # split strings based on ','
    string_list = grades_string.split(',')

    # look for sections of list with '-'
    dash = "-"
    for i in range(len(string_list)):
        clean_string = string_list[i].strip()
        if dash in clean_string:
            #  split using '-', loop and add to grades variable
            start_grade, end_grade = clean_string.split(dash)
            grades += GRADES[GRADES.index(start_grade) : GRADES.index(end_grade)+ 1]
        else:
            # add string to grades
            grades.append(clean_string)

    return grades

In [26]:
print(df['Grades'].nunique())
unique_grades_combination  = df['Grades'].unique()

302

In [27]:
def test_complete_dataset(unique_grades_combination):
    # create a loop that goes thru dataset and invoke parse_grades with each element
    separated_grades_list = []
    for i in unique_grades_combination:
        separated_grades_list.append(parse_grades(i))

    dictionary_grade_list = dict(zip(unique_grades_combination, separated_grades_list))

    return dictionary_grade_list

In [28]:
dictionary = test_complete_dataset(unique_grades_combination)

In [29]:
df['Clean_Grades'] = df['Grades'].map(dictionary)

In [30]:
high_school = ['9', '10', '11', '12']
middle_school = ['6', '7', '8']
elementary = ['K', '1', '2', '3', '4', '5']
pre_k = ['PK']

In [31]:
set1 = set(high_school)
df['High School (9-12)'] = df['Clean_Grades'].apply(lambda x: any([k in x for k in set1]))

In [32]:
set2 = set(middle_school)
df['Middle School (6-8)'] = df['Clean_Grades'].apply(lambda x: any([k in x for k in set2]))

In [33]:
set3 = set(elementary)
df['Elementary (K-5)'] = df['Clean_Grades'].apply(lambda x: any([k in x for k in set3]))

In [34]:
set4 = set(pre_k)
df['Pre-Kindergarten (PK)'] = df['Clean_Grades'].apply(lambda x: any([k in x for k in set4]))

In [35]:
df[['High School (9-12)', 'Middle School (6-8)', 'Elementary (K-5)', 'Pre-Kindergarten (PK)']] = df[['High School (9-12)', 'Middle School (6-8)', 'Elementary (K-5)', 'Pre-Kindergarten (PK)']] * 1

In [36]:
df['Grades'] = df['Grades'].str.replace(' & Ungraded', '')

### Check that parse grades and categorizing schools worked

In [37]:
unique_grades_combination

array(['9-12', '6-8', 'K-4', '5-8', '4-5', 'K-5', '4-6', '7-12', 'K-6',
       '4-8', 'K-8', '1-6', 'PK-3', '6-12', 'K-3', 'PK-K', 'PK', 'PK-8',
       'PK-6', '4-12', 'PK-6 & Ungraded', '1-8', 'K', 'PK-5', 'PK-12',
       '7-11', '3-6', 'K-12', '3-8', '2-10', 'K-1, 5-8', 'PK-4',
       'Ungraded', '1-12', '2-5', '3-5', '10-12', 'PK-1 & Ungraded',
       'K-11', 'K-2', 'K-1', '9-10', 'K-7', '1-5', 'PK-1', 'PK-K, 2',
       'PK-2', '7-8', 'PK-11', '9', 'K-9', '2-11', '2-12', '2-9', '8-12',
       'K-10', 'PK & Ungraded', '7-9', '6', '5-6', '2, 5-6, 8-9, 11-12',
       '11-12', '3-12', 'K-1, 3-4, 6-7, 9, 11', '1-11', 'PK-9, 11-12',
       'PK-9', '5-12', '6-10', '11', '3-7', '7-10', 'PK-10',
       'PK-12 & Ungraded', '6-9', '4-9', '9-11', '6-7', '5-12 & Ungraded',
       '8-11', '2-8', '3, 5, 7-11', 'PK, 8', 'PK-7', '6, 9-12', '1-3',
       'K-3, 5-10, 12', 'PK-8 & Ungraded', '5', '12', 'K-8, 10-12', '1-9',
       '1-5, 7-8', '9, 12', '5-7', '4-7', '8', '3-10', '1-12 & Ungraded',
       '5, 7-8, 10-12', 'PK, 1-4', '1-4', '3, 6-7, 10, 12',
       '3-4, 6, 9-12', '1-2', '8-9', '4', 'PK-3, 5-7', 'K-1, 4, 6, 8',
       '5-10', '6-12 & Ungraded', '6-11', 'K, 5-12', 'K-6, 8',
       'PK-4 & Ungraded', 'PK-1, 3-5', 'PK-1, 3', '10-12 & Ungraded',
       'K-3, 5-9, 11-12', 'PK-K, 2-4, 6-8', 'PK, 3-4', '1-7', '1-10',
       'PK, 2', '2, 4, 7, 9-10, 12', 'PK, 1', '1-3, 5, 8', '1-3, 5-6, 8',
       'K, 3, 5-12', '4-11', 'K-4, 7-8', '7-8, 10-12', 'PK, 1, 3-12',
       '7, 9-12', 'PK-2, 6, 8', '2-6', 'PK-8, 10-11', '2-3', '3-4',
       'PK, 3-5', '3-9', 'PK-4, 6', 'PK, 1-6', 'PK-4, 8', 'PK-K, 9-12',
       '3-11', 'PK-3 & Ungraded', 'PK-3, 5-6', '2-7', '2-12 & Ungraded',
       'PK-K, 2-7', '8-10', '2-4', 'PK-4, 6-8', 'PK-K, 3-5, 7', '7, 11',
       'K-5, 7, 9-10, 12', 'PK-K, 2-4, 6 & Ungraded', '2', 'PK-7, 11',
       'K, 2, 4-9, 12', 'PK-1, 4, 6', '9-12 & Ungraded', '4-6, 8',
       '2-4, 6, 9-12', 'PK-3, 5-8', '1-2, 4-8', 'PK, 12', '10',
       '3-5, 9-10, 12', '5-11', '2-3, 5, 10-12', '3-10, 12',
       'K-12 & Ungraded', '4-10', 'PK-1, 3, 5', 'PK-1, 5, 7, 9',
       'PK-K, 2-5', 'K, 2-7, 9', 'K-7, 9-12', '2, 6-7', '6-10, 12',
       'K-5, 7-9, 11', '2, 4, 6, 8, 10, 12', 'K-2, 4-12', 'PK, 7-12',
       '1, 3-4, 6-12', 'K-6, 8-11', '2-5, 7-12', '1, 4-10, 12',
       'PK-2, 4, 6, 8', 'K-10, 12', '9 & Ungraded', 'PK-5 & Ungraded',
       'PK-3, 5', '1, 3-5, 7', 'PK, 2, 4-7, 9-10, 12', 'K, 2, 5-12',
       'PK-4, 6-12', '3', '4, 10', '2, 5-6, 8-12', 'K-6, 8-12',
       'PK, 3-6, 8, 10, 12', 'K-3, 6-8', '3-9, 11-12', 'PK-5, 7-12',
       'K, 2-4, 7-12', '1-4, 6-8', 'PK-3, 5-12', '1-3, 5-9', '1, 3-8',
       '9-11 & Ungraded', '5-9', 'K, 4-5, 7-8', 'PK, 1-5',
       '3-12 & Ungraded', 'K-8 & Ungraded', '2-3, 5-8', '1-6, 9-12',
       'PK-8, 10-12', 'PK-K, 4-8', 'K-1, 7-12', 'K-4, 6-7, 9-12',
       '9-10, 12', 'K-5, 7', 'K, 2-8', '1, 4, 7, 10-11', 'K, 2-3, 5-6',
       'K-5, 7, 11-12', '7', 'PK-4, 7-12', 'K-9, 11-12', 'K-4, 6-8, 10',
       '1, 3-5, 7-12', 'K-2, 5-7', 'K, 3, 6-8, 10, 12', 'K, 3, 7-8, 12',
       'PK, 9-12', 'K-2, 4-10, 12', '12 & Ungraded', 'PK-6, 8-10',
       'PK-1, 3-8', '1, 3', 'K-8, 12', '3-4, 6-9, 12', '5, 7-8',
       'PK-K, 2-3', 'K-1, 3-12', '1, 5-9, 12', '5, 7-8, 10-11',
       'PK-5, 7-8', '4, 7, 10-12', 'PK-1, 3-4', 'PK-2, 4-6', 'K-8, 10',
       '10-11', '6, 9', 'PK-2, 4', 'K-4, 6', 'K-2, 6-7, 12', 'PK-6, 8',
       '3-4, 7, 10-12', '1, 3-7', 'K-5, 8', '2, 4-5, 7, 9-11',
       '1-3, 5, 7-8', '1-2, 9-12', 'K-1, 3-5, 7-8', 'K, 2-8, 10',
       'PK, 1-3, 6', '7-8, 10-11', '7, 10-12', '3, 5, 8-9, 11-12',
       '1-3, 5', 'K-5, 7-12', '1-7, 9-10, 12', '2, 4-8', 'K-3, 6-12',
       'PK, 5-8', '6-8, 10', 'PK-5, 7', 'PK, 1, 5', 'PK, 1-4, 6',
       '3, 5, 10, 12', 'PK-6, 8-12', '4-5, 7-12', 'PK-1, 6-7, 9-11',
       '2-7, 9-11', 'K-1, 6, 8, 11', '7, 9, 11-12', '1-3, 5-10',
       'K-5, 7-9', '1', 'K-5, 7-11', '7-12 & Ungraded', '1-6 & Ungraded',
       '3, 12', 'PK-8, 11', 'K-5, 7-9, 12', 'K-1, 4, 7-9, 11',
       '1-2, 4-12'], dtype=object)

In [38]:
df.loc[df['Grades'] == 'PK-6']

,Unnamed: 0,School,Score,Rating,Address,Type,Grades,Total Students Enrolled,Students per teacher,District,"City, State",Length,City,State,Clean_Grades,High School (9-12),Middle School (6-8),Elementary (K-5),Pre-Kindergarten (PK)
112,112,Our Lady Of The Elms Elementary School,0,Currently unrated,"1290 West Market Street, Akron, OH, 44313",Private,PK-6,125.0,NaN,NaN,"[1290 West Market Street, Akron, OH, 44313]",4,Akron,OH,"[PK, K, 1, 2, 3, 4, 5, 6]",0,1,1,1
124,124,Chapel Hill Christian School-Green Campus,0,Currently unrated,"1639 Killian Rd, Akron, OH, 44312",Private,PK-6,210.0,NaN,NaN,"[1639 Killian Rd, Akron, OH, 44312]",4,Akron,OH,"[PK, K, 1, 2, 3, 4, 5, 6, Ungraded]",0,1,1,1
542,542,Coral Community Charter,7,Above average,"4401 Silver Avenue Southeast, Albuquerque, NM, 87108",Public charter,PK-6,243.0,15:1,Coral Community Charter,"[4401 Silver Avenue Southeast, Albuquerque, NM, 87108]",4,Albuquerque,NM,"[PK, K, 1, 2, 3, 4, 5, 6]",0,1,1,1
589,589,Los Padillas Elementary School,5,Average,"2525 Los Padillas Road Southwest, Albuquerque, NM, 87105",Public district,PK-6,196.0,15:1,Albuquerque Public Schools,"[2525 Los Padillas Road Southwest, Albuquerque, NM, 87105]",4,Albuquerque,NM,"[PK, K, 1, 2, 3, 4, 5, 6]",0,1,1,1
647,647,Pajarito Elementary School,2,Below average,"2701 Don Felipe Road Southwest, Albuquerque, NM, 87105",Public district,PK-6,448.0,14:1,Albuquerque Public Schools,"[2701 Don Felipe Road Southwest, Albuquerque, NM, 87105]",4,Albuquerque,NM,"[PK, K, 1, 2, 3, 4, 5, 6]",0,1,1,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
58694,58694,Ronald Reagan Fundamental School,4,Below average,"3200 West 16th Street, Yuma, AZ, 85364",Public district,PK-6,552.0,25:1,Crane Elementary District,"[3200 West 16th Street, Yuma, AZ, 85364]",4,Yuma,AZ,"[PK, K, 1, 2, 3, 4, 5, 6]",0,1,1,1
58697,58697,Gary A. Knox Elementary School,4,Below average,"2926 S. 21st Drive, Yuma, AZ, 85364",Public district,PK-6,656.0,25:1,Crane Elementary District,"[2926 S. 21st Drive, Yuma, AZ, 85364]",4,Yuma,AZ,"[PK, K, 1, 2, 3, 4, 5, 6]",0,1,1,1
58701,58701,George Washington Carver Elementary School,3,Below average,"1341 West 5th Street, Yuma, AZ, 85364",Public district,PK-6,426.0,19:1,Yuma Elementary District,"[1341 West 5th Street, Yuma, AZ, 85364]",4,Yuma,AZ,"[PK, K, 1, 2, 3, 4, 5, 6]",0,1,1,1
58707,58707,Amerischools Academy - Yuma,0,Currently unrated,"2098 S. 3rd Ave., Yuma, AZ, 85364",Public charter,PK-6,162.0,18:1,The Charter Foundation Inc.,"[2098 S. 3rd Ave., Yuma, AZ, 85364]",4,Yuma,AZ,"[PK, K, 1, 2, 3, 4, 5, 6]",0,1,1,1
58711,58711,Pecan Grove Elementary School,0,Currently unrated,"600 South 21st Avenue, Yuma, AZ, 85364",Public district,PK-6,299.0,19:1,Yuma Elementary District,"[600 South 21st Avenue, Yuma, AZ, 85364]",4,Yuma,AZ,"[PK, K, 1, 2, 3, 4, 5, 6]",0,1,1,1

In [39]:
df.loc[df['Grades'] == 'K-1, 4, 7-9, 11']

,Unnamed: 0,School,Score,Rating,Address,Type,Grades,Total Students Enrolled,Students per teacher,District,"City, State",Length,City,State,Clean_Grades,High School (9-12),Middle School (6-8),Elementary (K-5),Pre-Kindergarten (PK)
58632,58632,Covenant Christian,0,Currently unrated,"9882 Garden Hwy, Yuba City, CA, 95991",Private,"K-1, 4, 7-9, 11",NaN,NaN,NaN,"[9882 Garden Hwy, Yuba City, CA, 95991]",4,Yuba City,CA,"[K, 1, 4, 7, 8, 9, 11]",1,1,1,0

In [40]:
df.loc[df['Grades'] == 'PK, 3-6, 8, 10, 12']

,Unnamed: 0,School,Score,Rating,Address,Type,Grades,Total Students Enrolled,Students per teacher,District,"City, State",Length,City,State,Clean_Grades,High School (9-12),Middle School (6-8),Elementary (K-5),Pre-Kindergarten (PK)
25860,25860,Tet Christian Academy,0,Currently unrated,"695 Ocean Ave, Jersey City, NJ, 07305",Private,"PK, 3-6, 8, 10, 12",NaN,NaN,NaN,"[695 Ocean Ave, Jersey City, NJ, 07305]",4,Jersey City,NJ,"[PK, 3, 4, 5, 6, 8, 10, 12]",1,1,1,1

### Filling in NaNs

In [41]:
df.isnull().sum()

Unnamed: 0               0
School                   0
Score                    0
Rating                   0
Address                  0
                        ..
Clean_Grades             0
High School (9-12)       0
Middle School (6-8)      0
Elementary (K-5)         0
Pre-Kindergarten (PK)    0
Length: 19, dtype: int64

In [42]:
df[['Total Students Enrolled', 'Students per teacher']] = df[['Total Students Enrolled', 'Students per teacher']].fillna(0)

In [43]:
df['District'] = df['District'].fillna('Unavailable')

In [44]:
df.isnull().sum()

Unnamed: 0               0
School                   0
Score                    0
Rating                   0
Address                  0
                        ..
Clean_Grades             0
High School (9-12)       0
Middle School (6-8)      0
Elementary (K-5)         0
Pre-Kindergarten (PK)    0
Length: 19, dtype: int64

In [45]:
df.loc[df['Students per teacher'] == 'NaN']

Empty DataFrame
Columns: [Unnamed: 0, School, Score, Rating, Address, Type, Grades, Total Students Enrolled, Students per teacher, District, City, State, Length, City, State, Clean_Grades, High School (9-12), Middle School (6-8), Elementary (K-5), Pre-Kindergarten (PK)]
Index: []

In [46]:
df.loc[df['District'] == 'NaN']

Empty DataFrame
Columns: [Unnamed: 0, School, Score, Rating, Address, Type, Grades, Total Students Enrolled, Students per teacher, District, City, State, Length, City, State, Clean_Grades, High School (9-12), Middle School (6-8), Elementary (K-5), Pre-Kindergarten (PK)]
Index: []

In [47]:
df.loc[df['Total Students Enrolled'] == 'NaN']

Empty DataFrame
Columns: [Unnamed: 0, School, Score, Rating, Address, Type, Grades, Total Students Enrolled, Students per teacher, District, City, State, Length, City, State, Clean_Grades, High School (9-12), Middle School (6-8), Elementary (K-5), Pre-Kindergarten (PK)]
Index: []

### Cleaning Extra Spaces
- drop unneccessary columns

In [48]:
df['City'] = df['City'].str.strip()
df['State'] = df['State'].str.strip()
df['Address'] = df['Address'].str.strip()
df['School'] = df['School'].str.strip()
df['Rating'] = df['Rating'].str.strip()
df['Address'] = df['Address'].str.strip()
df['Type'] = df['Type'].str.strip()
df['Grades'] = df['Grades'].str.strip()
df['Students per teacher'] = df['Students per teacher'].str.strip()
df['District'] = df['District'].str.strip()

# Drop
df = df.drop(columns = ['City, State', 'Length', 'Clean_Grades'])

### Save

In [49]:
df.to_csv('files/merge_schools/schools_cleaned.csv', index = False)

## Part 2
- clean csv of cities that did not scrape the first time

In [1]:
import pandas as pd
pd.set_option('display.max_colwidth', None)
pd.set_option('display.max_rows', 10)

/Users/jisha/.pyenv/versions/3.8.6/lib/python3.8/site-packages/pandas/compat/__init__.py:120: UserWarning: Could not import the lzma module. Your installed Python is incomplete. Attempting to use lzma compression will result in a RuntimeError.
  warnings.warn(msg)

In [2]:
missing = pd.read_csv('files/scrape_schools/missing_schools.csv')

In [3]:
print(missing.shape)
missing.head()

(8941, 10)

,Unnamed: 0,School,Score,Rating,Address,Type,Grades,Total Students Enrolled,Students per teacher,District
0,0,Jones College Prep High School,10/10,Top rated,"700 South State Street, Chicago, IL, 60605",Public district,9-12,1861.0,17:1,City Of Chicago School District 299
1,1,Northside College Preparatory High School,10/10,Top rated,"5501 North Kedzie Avenue, Chicago, IL, 60625",Public district,9-12,1061.0,16:1,City Of Chicago School District 299
2,2,Payton College Preparatory High School,10/10,Top rated,"1034 North Wells Street, Chicago, IL, 60610",Public district,9-12,1073.0,15:1,City Of Chicago School District 299
3,3,Devry Advantage Academy High School,10/10,Top rated,"3300 North Campbell Avenue, Chicago, IL, 60618",Public district,11-12,193.0,18:1,City Of Chicago School District 299
4,4,Westinghouse High School,9/10,Above average,"3223 West Franklin Boulevard, Chicago, IL, 60624",Public district,9-12,1192.0,16:1,City Of Chicago School District 299

In [4]:
# Adresses
missing['Address'] = missing['Address'].str.replace('5115 North Mont Clare Avenue Chicago, IL 60656, Chicago, IL, 60656', '5115 North Mont Clare Avenue, Chicago, IL, 60656')
missing['Address'] = missing['Address'].str.replace('11000 Scott St, Houston, Houston, TX, 77047', '11000 Scott St, Houston, TX, 77047')
missing['Address'] = missing['Address'].str.replace('3911 Campbell Rd., Ho, Houston, TX, 77080', '3911 Campbell Rd., Houston, TX, 77080')
missing['Address'] = missing['Address'].str.replace('8805 Ferndale, Houston, Houston, TX, 77017', '8805 Ferndale, Houston, TX, 77017')
missing['Address'] = missing['Address'].str.replace('4240 E. Olympic Blvd. Los Angeles, CA 90023, Los Angeles, CA, 90063', '4240 E. Olympic Blvd., Los Angeles, CA, 90023')
missing['Address'] = missing['Address'].str.replace('1263 S Soto St Los Angeles, CA 90023 , Los Angeles, CA, 90031', '1263 S Soto St, Los Angeles, CA, 90023')
missing['Address'] = missing['Address'].str.replace('95 NW 23rd St Miami, FL 33127, Miami, FL, 33137', '95 NW 23rd St, Miami, FL, 33127')
missing['Address'] = missing['Address'].str.replace('12101 SW 34 St. MIAMI, FL. 33175, Miami, FL, 33175', '12101 SW 34 St., Miami, FL, 33175')
missing['Address'] = missing['Address'].str.replace('332 West 43rd Street, New York NY 10036, New York, NY, 10025', '332 West 43rd Street, New York, NY, 10025')
missing['Address'] = missing['Address'].str.replace('120 Wadsworth Avenue New York, N.Y. 10033, New York, NY, 10033', '120 Wadsworth Avenue, New York, NY, 10033')
missing['Address'] = missing['Address'].str.replace('5311 Merlin Dr San Antonio, Texas 78218, San Antonio, TX, 78218', '5311 Merlin Dr, San Antonio, TX, 78218')
missing['Address'] = missing['Address'].str.replace('8565 Ewing Halsell Drive San Antonio, Texas 78229, San Antonio, TX, 78229', '8565 Ewing Halsell Drive, San Antonio, TX, 78229')
missing['Address'] = missing['Address'].str.replace('4419 S Normandie Ave La, Ca 90037, Los Angeles, CA, 90007', '4419 S Normandie Ave, Los Angeles, CA, 90037')

missing['Address'] = missing['Address'].str.replace('2521 Grove Street, Blue Island, IL 60406, Chicago, IL, 60643', '2521 Grove Street, Blue Island, IL, 60406')
missing['Address'] = missing['Address'].str.replace('1913 Southwest Fwy #B, Houston, TX 77098, Houston, TX, 77030', '1913 Southwest Fwy #B, Houston, TX, 77098')
missing['Address'] = missing['Address'].str.replace('4009 Sherwood Lane, Houston, TX 77092, Houston, TX, 77092', '4009 Sherwood Lane, Houston, TX, 77092')
missing['Address'] = missing['Address'].str.replace('1600 W. Imperial Highway, Los Angeles, CA 90047, Los Angeles, CA, 90045', '1600 W. Imperial Highway, Los Angeles, CA, 90047')
missing['Address'] = missing['Address'].str.replace('131 E. 50th Street, Los Angles, CA 90011, Los Angeles, CA, 90011', '131 E. 50th Street, Los Angeles, CA, 90011')
missing['Address'] = missing['Address'].str.replace('4301 West Martin Luther King Jr. Boulevard, Los Angeles, CA 90008, Los Angeles, CA, 90016', '4301 West Martin Luther King Jr. Boulevard, Los Angeles, CA, 90008')
missing['Address'] = missing['Address'].str.replace('8515 Kansas Avenue, Los Angeles, CA 90044, Los Angeles, CA, 90047', '8515 Kansas Avenue, Los Angeles, CA, 90044')
missing['Address'] = missing['Address'].str.replace('1989 Westwood Blvd, LA, CA 90025, Los Angeles, CA, 90025', '1989 Westwood Blvd, Los Angeles, CA, 90025')
missing['Address'] = missing['Address'].str.replace('6601 NW 167th St, Hialeah, FL 33015, Miami, FL, 33015', '6601 NW 167th St, Hialeah, FL, 33015')
missing['Address'] = missing['Address'].str.replace('7412 Sunset Drive, Miami, FL 33143, Miami, FL, 33176', '7412 Sunset Drive, Miami, FL, 33143')
missing['Address'] = missing['Address'].str.replace('259 10th Avenue, New York, NY 10001, New York, NY, 10001', '259 10th Avenue, New York, NY, 10001')

missing['Address'] = missing['Address'].str.replace('2212 Third Avenue, 2nd Floor, New York, NY 10035, New York, NY, 10065', '2212 Third Avenue, 2nd Floor, New York, NY, 10035')

missing['Address'] = missing['Address'].str.replace('10126 South Western, CHICAGO, IL, 60643', '10126 South Western, Chicago, IL, 60643')
missing['Address'] = missing['Address'].str.replace('38 delancey st., new york, NY, 10002', '38 Delancey St., New York, NY, 10002')
missing['Address'] = missing['Address'].str.replace('40 Rector Street, new york, NY, 10006', '40 Rector Street, New York, NY, 10006')

# specific
missing.at[3886, 'Address'] = '4240 E. Olympic Blvd., Los Angeles, CA, 90023'

### Split Address Column

In [5]:
missing['City, State'] = missing['Address'].str.split(',')

### Create Lengths to find discrepancies in Address column

In [6]:
# Finding length because there are anomalies with the information in the address column
missing['Length'] = missing['City, State'].apply(lambda x: len(x) if x != None else 0 )
# 4 is the expected length 
missing['Length'].unique()

array([4, 5, 6])

### Create City, State column

In [7]:
missing['City']  = missing['City, State'].str[-3]

In [8]:
missing['State']  = missing['City, State'].str[-2]

### Check for Unique Cities
should be about 5 (maybe slightly more after cleaning addresses)

In [9]:
print(missing['City'].nunique())
missing['City'].unique()

8

array([' Chicago', ' Blue Island', ' Houston', ' Los Angeles', ' Miami',
       ' Hialeah', ' New York', ' San Antonio'], dtype=object)

### Check for Unique States
- expecting 5

In [10]:
print(missing['State'].nunique())
missing['State'].unique()

5

array([' IL', ' TX', ' CA', ' FL', ' NY'], dtype=object)

### Update School Scores

In [11]:
missing['Score'] = missing['Score'].str.replace('/10', '')
missing['Score'] = missing['Score'].astype(int)

### Separate into PK, Elementary, Middle, High School

In [12]:
def parse_grades(grades_string):
    GRADES = ['PK', 'K', '1', '2', '3', '4', '5', '6', '7', '8', '9', '10', '11', '12', 'Ungraded']

    # Remove & for grades list
    grades_string = grades_string.replace(' &', ',')

    # Grades list - will add to separated grade string to grades
    grades = []

    # split strings based on ','
    string_list = grades_string.split(',')

    # look for sections of list with '-'
    dash = "-"
    for i in range(len(string_list)):
        clean_string = string_list[i].strip()
        if dash in clean_string:
            #  split using '-', loop and add to grades variable
            start_grade, end_grade = clean_string.split(dash)
            grades += GRADES[GRADES.index(start_grade) : GRADES.index(end_grade)+ 1]
        else:
            # add string to grades
            grades.append(clean_string)

    return grades

In [13]:
print(missing['Grades'].nunique())
unique_grades_combination  = missing['Grades'].unique()

134

In [14]:
def test_complete_dataset(unique_grades_combination):
    # create a loop that goes thru dataset and invoke parse_grades with each element
    separated_grades_list = []
    for i in unique_grades_combination:
        separated_grades_list.append(parse_grades(i))

    dictionary_grade_list = dict(zip(unique_grades_combination, separated_grades_list))

    return dictionary_grade_list

In [15]:
dictionary = test_complete_dataset(unique_grades_combination)

In [16]:
missing['Clean_Grades'] = missing['Grades'].map(dictionary)

In [17]:
# https://stackoverflow.com/questions/53350793/how-to-check-if-pandas-column-has-value-from-list-of-string

In [18]:
high_school = ['9', '10', '11', '12']
middle_school = ['6', '7', '8']
elementary = ['K', '1', '2', '3', '4', '5']
pre_k = ['PK']

In [19]:
set1 = set(high_school)
missing['High School (9-12)'] = missing['Clean_Grades'].apply(lambda x: any([k in x for k in set1]))

In [20]:
set2 = set(middle_school)
missing['Middle School (6-8)'] = missing['Clean_Grades'].apply(lambda x: any([k in x for k in set2]))

In [21]:
set3 = set(elementary)
missing['Elementary (K-5)'] = missing['Clean_Grades'].apply(lambda x: any([k in x for k in set3]))

In [22]:
set4 = set(pre_k)
missing['Pre-Kindergarten (PK)'] = missing['Clean_Grades'].apply(lambda x: any([k in x for k in set4]))

In [23]:
missing[['High School (9-12)', 'Middle School (6-8)', 'Elementary (K-5)', 'Pre-Kindergarten (PK)']] = missing[['High School (9-12)', 'Middle School (6-8)', 'Elementary (K-5)', 'Pre-Kindergarten (PK)']] * 1

In [24]:
missing['Grades'] = missing['Grades'].str.replace(' & Ungraded', '')

### Check

In [25]:
missing.loc[missing['Grades'] == 'PK-3, 5-8']

,Unnamed: 0,School,Score,Rating,Address,Type,Grades,Total Students Enrolled,Students per teacher,District,"City, State",Length,City,State,Clean_Grades,High School (9-12),Middle School (6-8),Elementary (K-5),Pre-Kindergarten (PK)
1266,1266,Learning Network,0,Currently unrated,"5911 West Midway Park, Chicago, IL, 60644",Private,"PK-3, 5-8",NaN,NaN,NaN,"[5911 West Midway Park, Chicago, IL, 60644]",4,Chicago,IL,"[PK, K, 1, 2, 3, 5, 6, 7, 8]",0,1,1,1

### Filling NaNs

In [26]:
missing.isna().sum()

Unnamed: 0               0
School                   0
Score                    0
Rating                   0
Address                  0
                        ..
Clean_Grades             0
High School (9-12)       0
Middle School (6-8)      0
Elementary (K-5)         0
Pre-Kindergarten (PK)    0
Length: 19, dtype: int64

In [27]:
missing[['Total Students Enrolled', 'Students per teacher']] = missing[['Total Students Enrolled', 'Students per teacher']].fillna(0)

In [28]:
missing['District'] = missing['District'].fillna('Unavailable')

In [29]:
missing.isna().sum()

Unnamed: 0               0
School                   0
Score                    0
Rating                   0
Address                  0
                        ..
Clean_Grades             0
High School (9-12)       0
Middle School (6-8)      0
Elementary (K-5)         0
Pre-Kindergarten (PK)    0
Length: 19, dtype: int64

### Clean and Drop columns

In [30]:
missing['City'] = missing['City'].str.strip()
missing['State'] = missing['State'].str.strip()
missing['Address'] = missing['Address'].str.strip()
missing['School'] = missing['School'].str.strip()
missing['Rating'] = missing['Rating'].str.strip()
missing['Address'] = missing['Address'].str.strip()
missing['Type'] = missing['Type'].str.strip()
missing['Grades'] = missing['Grades'].str.strip()
missing['Students per teacher'] = missing['Students per teacher'].str.strip()
missing['District'] = missing['District'].str.strip()

# Drop
missing = missing.drop(columns = ['City, State', 'Length', 'Clean_Grades'])

In [31]:
missing.to_csv('files/merge_schools/missing_schools_cleaned.csv', index = False)

## Part 3  Merge
1. remove cities in missing_cities from df to prevent duplicates
 - 'Chicago', 'Blue Island', 'Houston', 'Los Angeles', 'Miami', 'Hialeah', 'New York', 'San Antonio'
2. Merge
3. Clean

In [1]:
import pandas as pd
pd.set_option('display.max_colwidth', None)
pd.set_option('display.max_rows', 25)

/Users/jisha/.pyenv/versions/3.8.6/lib/python3.8/site-packages/pandas/compat/__init__.py:120: UserWarning: Could not import the lzma module. Your installed Python is incomplete. Attempting to use lzma compression will result in a RuntimeError.
  warnings.warn(msg)

In [2]:
df = pd.read_csv('files/merge_schools/schools_cleaned.csv')
missing = pd.read_csv('files/merge_schools/missing_schools_cleaned.csv')

In [3]:
print(df.shape)
df.head()

(58779, 16)

,Unnamed: 0,School,Score,Rating,Address,Type,Grades,Total Students Enrolled,Students per teacher,District,City,State,High School (9-12),Middle School (6-8),Elementary (K-5),Pre-Kindergarten (PK)
0,0,Akron Early College High School,10,Top rated,"225 South Main Street, Akron, OH, 44308",Public district,9-12,384.0,34:1,Akron City School District,Akron,OH,1,0,0,0
1,1,Revere Middle School,9,Above average,"3195 Spring Valley Road, Akron, OH, 44333",Public district,6-8,624.0,13:1,Revere Local School District,Akron,OH,0,1,0,0
2,2,Arrowhead Primary Elementary School,8,Above average,"1600 Raleigh Boulevard, Akron, OH, 44321",Public district,K-4,345.0,20:1,Copley-Fairlawn City School District,Akron,OH,0,0,1,0
3,3,Manchester Middle School,8,Above average,"760 West Nimisila Road, Akron, OH, 44319",Public district,5-8,387.0,16:1,Manchester Local School District,Akron,OH,0,1,1,0
4,4,Nolley Elementary School,8,Above average,"6285 Renninger Rd, Akron, OH, 44319",Public district,K-4,483.0,17:1,Manchester Local School District,Akron,OH,0,0,1,0

In [4]:
print(missing.shape)
missing.head()

(8941, 16)

,Unnamed: 0,School,Score,Rating,Address,Type,Grades,Total Students Enrolled,Students per teacher,District,City,State,High School (9-12),Middle School (6-8),Elementary (K-5),Pre-Kindergarten (PK)
0,0,Jones College Prep High School,10,Top rated,"700 South State Street, Chicago, IL, 60605",Public district,9-12,1861.0,17:1,City Of Chicago School District 299,Chicago,IL,1,0,0,0
1,1,Northside College Preparatory High School,10,Top rated,"5501 North Kedzie Avenue, Chicago, IL, 60625",Public district,9-12,1061.0,16:1,City Of Chicago School District 299,Chicago,IL,1,0,0,0
2,2,Payton College Preparatory High School,10,Top rated,"1034 North Wells Street, Chicago, IL, 60610",Public district,9-12,1073.0,15:1,City Of Chicago School District 299,Chicago,IL,1,0,0,0
3,3,Devry Advantage Academy High School,10,Top rated,"3300 North Campbell Avenue, Chicago, IL, 60618",Public district,11-12,193.0,18:1,City Of Chicago School District 299,Chicago,IL,1,0,0,0
4,4,Westinghouse High School,9,Above average,"3223 West Franklin Boulevard, Chicago, IL, 60624",Public district,9-12,1192.0,16:1,City Of Chicago School District 299,Chicago,IL,1,0,0,0

In [5]:
# Removing cities from schools to prevent duplicate cities
df = df[df['City'] != 'Chicago']
df = df[df['City'] != 'Houston']
df = df[df['City'] != 'Los Angeles']
df = df[df['City'] != 'Miami']
df = df[df['City'] != 'New York']
df = df[df['City'] != 'San Antonio']

In [6]:
frames = [df, missing]
final = pd.concat(frames)

In [7]:
print(final.shape) # 58779 + 8941 - 150(dropped cities) = 67570
final.head()

(67570, 16)

,Unnamed: 0,School,Score,Rating,Address,Type,Grades,Total Students Enrolled,Students per teacher,District,City,State,High School (9-12),Middle School (6-8),Elementary (K-5),Pre-Kindergarten (PK)
0,0,Akron Early College High School,10,Top rated,"225 South Main Street, Akron, OH, 44308",Public district,9-12,384.0,34:1,Akron City School District,Akron,OH,1,0,0,0
1,1,Revere Middle School,9,Above average,"3195 Spring Valley Road, Akron, OH, 44333",Public district,6-8,624.0,13:1,Revere Local School District,Akron,OH,0,1,0,0
2,2,Arrowhead Primary Elementary School,8,Above average,"1600 Raleigh Boulevard, Akron, OH, 44321",Public district,K-4,345.0,20:1,Copley-Fairlawn City School District,Akron,OH,0,0,1,0
3,3,Manchester Middle School,8,Above average,"760 West Nimisila Road, Akron, OH, 44319",Public district,5-8,387.0,16:1,Manchester Local School District,Akron,OH,0,1,1,0
4,4,Nolley Elementary School,8,Above average,"6285 Renninger Rd, Akron, OH, 44319",Public district,K-4,483.0,17:1,Manchester Local School District,Akron,OH,0,0,1,0

In [8]:
final.isnull().sum()

Unnamed: 0                     0
School                         0
Score                          0
Rating                         0
Address                        0
Type                           0
Grades                         0
Total Students Enrolled        0
Students per teacher       46829
District                       0
City                           0
State                          0
High School (9-12)             0
Middle School (6-8)            0
Elementary (K-5)               0
Pre-Kindergarten (PK)          0
dtype: int64

In [10]:
final['Students per teacher'] = final['Students per teacher'].fillna(0)

In [11]:
final.isnull().sum()

Unnamed: 0                 0
School                     0
Score                      0
Rating                     0
Address                    0
Type                       0
Grades                     0
Total Students Enrolled    0
Students per teacher       0
District                   0
City                       0
State                      0
High School (9-12)         0
Middle School (6-8)        0
Elementary (K-5)           0
Pre-Kindergarten (PK)      0
dtype: int64

In [12]:
final = final.drop(columns = ['Unnamed: 0'])

In [13]:
final.to_csv('csv/final_school.csv', index = False)